samples/ITI-47_response_raw.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
 <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <wsa:Action xmlns:mustUnderstand="http://www.w3.org/2003/05/soap-envelope" mustUnderstand:mustUnderstand="1">urn:hl7-org:v3:PRPA_IN201306UV02</wsa:Action>
  <wsa:RelatesTo>urn:uuid:9fe7246b-8fab-4dd7-976e-c81bc1955575</wsa:RelatesTo>
 </soapenv:Header>
 <soapenv:Body>
  <ns1:PRPA_IN201306UV02 xmlns:ns1="urn:hl7-org:v3" ITSVersion="XML_1.0">
   <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.2.3.4.5" extension="30"/>
   <ns1:creationTime xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:TS" value="20230911143413"/>
   <ns1:versionCode code="V3PR1"/>
   <ns1:interactionId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.840.1.113883" extension="PRPA_IN201306UV02"/>
   <ns1:processingCode code="P"/>
   <ns1:processingModeCode code="T"/>
   <ns1:acceptAckCode code="NE"/>
   <ns1:receiver typeCode="RCV">
    <ns1:device classCode="DEV" determinerCode="INSTANCE">
     <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.2.3.4"/>
     <ns1:asAgent classCode="AGNT">
      <ns1:representedOrganization classCode="ORG" determinerCode="INSTANCE">
       <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.2.3.4"/>
      </ns1:representedOrganization>
     </ns1:asAgent>
    </ns1:device>
   </ns1:receiver>
   <ns1:sender typeCode="SND">
    <ns1:device classCode="DEV" determinerCode="INSTANCE">
     <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.97"/>
     <ns1:asAgent classCode="AGNT">
      <ns1:representedOrganization classCode="ORG" determinerCode="INSTANCE">
       <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.7.127"/>
      </ns1:representedOrganization>
     </ns1:asAgent>
    </ns1:device>
   </ns1:sender>
   <ns1:acknowledgement>
    <ns1:typeCode code="AA"/>
    <ns1:targetMessage>
     <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.840.1.113883.1.6.1" extension="1.21694435653092"/>
    </ns1:targetMessage>
   </ns1:acknowledgement>
   <ns1:controlActProcess classCode="CACT" moodCode="EVN">
    <ns1:code xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:CD" code="PRPA_TE201306UV02"/>
    <ns1:subject typeCode="SUBJ" contextConductionInd="false">
     <ns1:registrationEvent classCode="REG" moodCode="EVN">
      <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" nullFlavor="NA"/>
      <ns1:statusCode code="active"/>
      <ns1:subject1 typeCode="SBJ">
       <ns1:patient classCode="PAT">
        <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.93" extension="25f98b34-0e01-48b7-a06c-f706eb4c485f" assigningAuthorityName="XDS Affinity Domain"/>
        <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.756.5.30.1.127.3.10.3" extension="761337610411353650" assigningAuthorityName="SPID"/>
        <ns1:statusCode code="active"/>
        <ns1:patientPerson classCode="PSN" determinerCode="INSTANCE">
         <ns1:name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:PN">
          <ns1:given>Dylan Jose</ns1:given>
          <ns1:family>Dell</ns1:family>
         </ns1:name>
         <ns1:administrativeGenderCode code="F"/>
         <ns1:birthTime xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:TS" value="19890622"/>
         <ns1:addr xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:AD" use="HP">
          <ns1:city>Pontarlier</ns1:city>
          <ns1:postalCode>25300</ns1:postalCode>
          <ns1:streetName>Ruelle de la Tour</ns1:streetName>
         </ns1:addr>
        </ns1:patientPerson>
        <ns1:providerOrganization classCode="ORG" determinerCode="INSTANCE">
         <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.13.20.2000"/>
         <ns1:contactParty classCode="CON"/>
        </ns1:providerOrganization>
        <ns1:subjectOf1>
         <ns1:queryMatchObservation classCode="COND" moodCode="EVN">
          <ns1:code xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:CD" code="IHE_PDQ"/>
          <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:INT" value="100"/>
         </ns1:queryMatchObservation>
        </ns1:subjectOf1>
       </ns1:patient>
      </ns1:subject1>
      <ns1:custodian typeCode="CST">
       <ns1:assignedEntity classCode="ASSIGNED">
        <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.12559.11.20.1"/>
        <ns1:assignedOrganization classCode="ORG" determinerCode="INSTANCE">
         <ns1:name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:EN">
          <ns1:given>org</ns1:given>
         </ns1:name>
        </ns1:assignedOrganization>
       </ns1:assignedEntity>
      </ns1:custodian>
     </ns1:registrationEvent>
    </ns1:subject>
    <ns1:queryAck>
     <ns1:queryId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.2.840.114350.1.13.28.1.18.5.999" extension="16944356511831"/>
     <ns1:statusCode code="deliveredResponse"/>
     <ns1:queryResponseCode code="OK"/>
     <ns1:resultTotalQuantity xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:INT" value="1"/>
     <ns1:resultCurrentQuantity xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:INT" value="1"/>
     <ns1:resultRemainingQuantity xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:INT" value="0"/>
    </ns1:queryAck>
    <ns1:queryByParameter>
     <ns1:queryId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.2.840.114350.1.13.28.1.18.5.999" extension="16944356511831"/>
     <ns1:statusCode code="new"/>
     <ns1:responseModalityCode code="R"/>
     <ns1:responsePriorityCode code="I"/>
     <ns1:parameterList>
      <ns1:livingSubjectId>
       <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.1.1.2.2" extension="08242eb8-dd47-4298-8d2f-25d60114f137"/>
       <ns1:semanticsText>LivingSubject.id</ns1:semanticsText>
      </ns1:livingSubjectId>
      <ns1:otherIDsScopingOrganization>
       <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.93"/>
       <ns1:semanticsText>OtherIDs.scopingOrganization.id</ns1:semanticsText>
      </ns1:otherIDsScopingOrganization>
      <ns1:otherIDsScopingOrganization>
       <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.756.5.30.1.127.3.10.3"/>
       <ns1:semanticsText>OtherIDs.scopingOrganization.id</ns1:semanticsText>
      </ns1:otherIDsScopingOrganization>
     </ns1:parameterList>
    </ns1:queryByParameter>
   </ns1:controlActProcess>
  </ns1:PRPA_IN201306UV02>
 </soapenv:Body>
</soapenv:Envelope>